class TithiModel {
  String? name;
  String? date;
  String? time;

  TithiModel({this.date, this.name, this.time});
}

List<TithiModel> tithiList = [
  TithiModel(
    date: "৪ জানুয়ারি",
    name: "শ্রীল সুভগ স্বামী গুরু মহারাজের ব্যাস পূজা",
  ),
  TithiModel(
    date: "২৫ জানুয়ারি",
    name: "পরমেশ্বর ভগবান শ্রীকৃষ্ণের পুষ্যাভিষেক",
  ),
  TithiModel(
    date: "১৪ ফেব্রুয়ারি",
    name: "শ্রী শ্রী স্বরস্বতী পূজা",
  ),
  TithiModel(
    date: "১৬ ফেব্রুয়ারি",
    name: "শ্রী অদ্বৈত আচার্যের আবির্ভাব তিথি",
  ),
  TithiModel(
    date: "২২ ফেব্রুয়ারি",
    name: "শ্রী নিত্যানন্দ এয়োদশী",
  ),
  TithiModel(
    date: "২৪ ফেব্রুয়ারি",
    name: "শ্রীল নরোত্তম দাস ঠাকুরের আবির্ভাব তিথি",
  ),
  TithiModel(
    date: "২৯ ফেব্রুয়ারি",
    name: "শ্রীল ভক্তিসিদ্ধান্ত সরস্বতি ঠাকুরের আবির্ভাব তিথি",
  ),
  TithiModel(
    date: "৯ মার্চ",
    name: "শ্রী শিবরাত্রি ব্রত",
  ),
  TithiModel(
    date: "২৫ মার্চ",
    name: "শ্রীমান গৌরাঙ্গ মহাপ্রভুর আবির্ভাব(গৌর পূর্ণিমা মহো মহোৎসব)",
  ),
  TithiModel(
    date: "১৭ এপ্রিল",
    name: "শ্রী রামনবমী মহোৎসব",
  ),
  TithiModel(
    date: "১৯ এপ্রিল",
    name: "শ্রীল জয়পতাকা স্বামী গুরু মহারাজের ৭৫ তম (ব্যাস পূজা)",
  ),
  TithiModel(
    date: "১০ মে",
    name: "অক্ষয় তৃতীয়া (চন্দন যাত্রা আরাম্ভ ২১ দিন)",
  ),
  TithiModel(
    date: "২২ মে",
    name: "শ্রী নৃসিংহ চতুর্দশী ব্রত (সন্ধ্যা পর্যন্ত উপবাস)",
  ),
  TithiModel(
    date: "১৬ জুন",
    name: "শ্রী গঙ্গা পূজা",
  ),
  TithiModel(
    date: "২০ জুন",
    name: "পানিহাটি চিড়া-দধি মহোৎসব",
  ),
  TithiModel(
    date: "২২ জুন",
    name: "শ্রী শ্রী জগন্নাথ দেবের স্নানযাত্রা",
  ),
  TithiModel(
    date: "০৬ জুলাই",
    name: "গুন্ডিচা মার্জন । শ্রীল ভক্তিবিনোদ ঠাকুরের তিরোভাব",
  ),
  TithiModel(
    date: " ০৭ জুলাই",
    name: "শ্রী শ্রী জগন্নাথদেবের রাথযাত্রা মহোৎসব",
  ),
  TithiModel(
    date: "১৫ জুলাই",
    name: "শ্রী শ্রী জগন্নাথদেবের উল্টো রথযাত্রা",
  ),
  TithiModel(
    date: "২৯ জুলাই",
    name: "নিউইয়র্কে ইস্ কন প্রতিষ্ঠাবার্ষিকী  ",
  ),
  TithiModel(
    date: "১৬ আগষ্ট",
    name: "শ্রী শ্রী রাধাগোবিন্দের ঝুলন যাত্রা আরম্ভ",
  ),
  TithiModel(
    date: "১৯ আগষ্ট",
    name: "শ্রী বলরামের আবির্ভাব তিথি মহোৎসব (বলরাম পূর্ণিমা)",
  ),
  TithiModel(
    date: "২৬ আগষ্ট",
    name: "পরমেশ্বর ভগবান শ্রীকৃষ্ণের জন্মাষ্টমী (মধ্যরাত পর্যন্ত উপবাস)",
  ),
  TithiModel(
    date: "২৭ আগষ্ট",
    name: "শ্রীনন্দোৎসব । শ্রীল প্রভুপাদের ১২৮ তম শুভ আবির্ভাব",
  ),
  TithiModel(
    date: "১১ সেপ্টেম্বর",
    name: "শ্রীমতি রাধারাণীর আবির্ভাব তিথি (রাধাষ্টমী-দুপুর পর্যন্ত উপবাস)",
  ),
  TithiModel(
    date: "১৭ সেপ্টেম্বর",
    name: "শ্রীল ভক্তিচারু স্বামী গুরুমহারাজের ৭৯ তম ব্যাসপূজা ",
  ),
  TithiModel(
    date: "১৮ সেপ্টেম্বর",
    name: "শ্রীশ্রী ভাদ্র পূর্ণিমা মহোৎসব",
  ),
  TithiModel(
    date: "১০ অক্টোবর",
    name: "শ্রী শ্রী দূর্গা পূজা (সপ্তমী)",
  ),
  TithiModel(
    date: "১৭ অক্টোবর",
    name: "শ্রী লক্ষী পূজা",
  ),
  TithiModel(
    date: "২১ অক্টোবর",
    name: "খেতুরী উৎসব",
  ),
  TithiModel(
    date: "০১ নভেম্বর",
    name: "দীপাবলী,কালী পূজা",
  ),
  TithiModel(
    date: "০২ নভেম্বর",
    name: "গোবর্ধন পূজা ও অন্নকূট মহোৎসব",
  ),
  TithiModel(
    date: "০৫ নভেম্বর",
    name: "শ্রীল প্রভুপাদের ৪৭ তম তিরোভাব তিথি (দুপুর পর্যন্ত উপবাস)",
  ),
  TithiModel(
    date: "১২ নভেম্বর",
    name: "শ্রী গৌরকিশোর দাস বাবাজির তিরোভাব (দুপুর পর্যন্ত উপবাস)",
  ),
  TithiModel(
    date: "১৬ নভেম্বর",
    name: "শ্রীকৃষ্ণের রাসযাত্রা",
  ),
  TithiModel(
    date: "১১ ডিসেম্বর",
    name: "শ্রীমদ্ভগবদ্গীতা জয়ন্তী মহোৎসব",
  ),
  TithiModel(
    date: "১৯ ডিসেম্বর",
    name: "শ্রীল ভক্তিসিদ্ধান্ত স্বরস্বতি ঠাকুরের তিরোভাব",
  ),
  TithiModel(
    date: "২৩ ডিসেম্বর",
    name: "শ্রীল সুভাগ স্বামী গুরু মহারাজের ব্যাস পূজা",
  ),
];
